src/ChartsOfCharacteristicTypes/bit_ПредопределенныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>bit_ПредопределенныеЗначения</Name>
			<Type>
				<v8:Type>xs:string</v8:Type>
				<v8:StringQualifiers>
					<v8:Length>10</v8:Length>
				</v8:StringQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.bit_ПредопределенныеЗначения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСервернаяПроцедура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняемаяПроцедура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗначенийЭлементов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.bit_ПредопределенныеЗначения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/ChartsOfCharacteristicTypes/bit_ПредопределенныеЗначения/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает значение ПВХ по имени.
//
// Параметры:
//  Имя - Строка - Имя переменной ПВХ.
// 
// Возвращаемое значение:
//  ПроизвольныйТип - Значение переменной ПВХ.
// 
Функция ПолучитьЗначение(Имя) Экспорт
	
	Возврат ПланыВидовХарактеристик.bit_ПредопределенныеЗначения[Имя].Значение;  
	
КонецФункции

// Возвращает массив значений ПВХ по имени.
//
// Параметры:
//  Имя - Строка - Имя переменной ПВХ.
// 
// Возвращаемое значение:
//  Массив - Значения переменной ПВХ.
//
Функция ПолучитьМассивЗначений(Имя) Экспорт
		
	Возврат ОбщегоНазначения.ВыгрузитьКолонку(
		ПланыВидовХарактеристик.bit_ПредопределенныеЗначения[Имя].СписокЗначенийЭлементов, "Значение", Истина);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
